Revit 2025 API
Zone.IsDefaultZone Property
Reports whether this zone is default or not.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public bool IsDefaultZone { get; set; }
Public Property IsDefaultZone As Boolean
	Get
	Set
public:
property bool IsDefaultZone {
	bool get ();
	void set (bool value);
}
member IsDefaultZone : bool with get, set
Property Value
Boolean
Remarks
This property can be used to set the current zone as the default zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace